# CannotCreateDimensionNotParallel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..CannotCreateDimensionNotParallel Property
BuiltInFailures..::..DimensionFailures Class See Also
---
Can't create dimension. Highlighted references are not parallel to first selection.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateDimensionNotParallel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateDimensionNotParallel As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateDimensionNotParallel {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace